# FilterOperatorAndTextString Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterOperatorAndTextString Properties
FilterOperatorAndTextString Class See Also
---
The FilterOperatorAndTextString type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterOperatorStr | A text string denoting the filter operator. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OperatorType | The filter operator. |

# See Also
FilterOperatorAndTextString Class
Autodesk.Revit.DB Namespace